[
  {
    "path": "organization/research-groups/",
    "title": "Research groups at SDCA",
    "description": "The different research groups and topics at SDCA",
    "author": [
      {
        "name": "Daniel B. Ibsen",
        "url": {}
      },
      {
        "name": "Tinne Laurberg",
        "url": {}
      }
    ],
    "date": "2021-11-23",
    "categories": [],
    "contents": "\nResearch groupsSteno Diabetes Center Aarhus covers a wide range of research areas. A patient-centered approach is achieved by research activities relevant to prevention and treatment of diabetes, or contribution to the understanding of the disease in humans.\nWe build upon a well-established research environment and long-standing collaborations between Aarhus University, Aarhus University Hospital and other hospitals in the Central Region of Denmark.\nFor more information on the research groups, please visit:\nhttps://www.stenoaarhus.dk/Research/\nhttps://twitter.com/stenoaarhusres\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-10T15:38:17+00:00",
    "input_file": {}
  },
  {
    "path": "organization/sdca-management/",
    "title": "SDCA management structure",
    "description": "Structure of the management team at SDCA",
    "author": [
      {
        "name": "Daniel B. Ibsen",
        "url": {}
      },
      {
        "name": "Tinne Laurberg",
        "url": {}
      }
    ],
    "date": "2021-11-23",
    "categories": [],
    "contents": "\n\nNote: This website and its contents are being actively developed and are at various states of completion.\n\n\nOverview of SDCA management teamAs opposed to other clinical departments at Aarhus University Hospital (AUH), SDCA is headed by a board and our CEO Troels Krarup Hansen is responsible to this board.\nThe board at SDCA consists of:\nOle Thomsen (chairman), Head of Corporate Management, Central Denmark Region\nMarianne Jensen, Chief Nursing Officer, Randers Regional Hospital\nPia Ulv Helleland, CEO, Lemvig Municipality\nLars Bo Nielsen, Dean, Health - Aarhus University\nClaus Thomsen, Chief Medical Officer, Aarhus University Hospital\nUlrik Meyer, Head of Programme, Novo Nordisk Foundation\nFor more information, please visit:\nhttps://www.stenoaarhus.dk/english/\nhttps://www.stenoaarhus.dk/siteassets/om-os/steno-diabetes-center-aarhus---summary-in-english.pdf\nwww.linkedin.com/company/steno-diabetes-center-aarhus\nwww.twitter.com/stenoaarhus\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-10T15:38:17+00:00",
    "input_file": {}
  }
]
